{
    "en": {
        "nav.home": "Home",
        "nav.about": "About",
        "nav.skills": "Skills",
        "nav.projects": "Projects",
        "nav.resume": "Resume",
        "nav.contact": "Contact",
        "hero.greeting": "Hello",
        "hero.tagline": "Platform Engineer | Infrastructure Automation | Big Data | Cloud",
        "hero.cta.projects": "View Projects",
        "hero.cta.cv": "Download CV",
        "about.title": "About Me",
        "about.preview.text": "Platform Engineer with expertise in infrastructure automation, Big Data ecosystems, and cloud technologies. Currently at MC Digital (Sonae), specializing in platform management, data infrastructure, and DevOps practices. Passionate about transforming complex technical challenges into efficient, scalable solutions that drive innovation.",
        "about.preview.highlight1": "Infrastructure as Code with Terraform & Azure",
        "about.preview.highlight2": "Linux System Administration & Automation",
        "about.preview.highlight3": "Big Data Platforms (Hadoop, Databricks, Cloudera)",
        "about.preview.highlight4": "Ansible & Bash Scripting for Automation",
        "about.preview.highlight5": "Python Development for Data Engineering",
        "about.readMore": "Read Full Story →",
        "skills.title": "Core Competencies",
        "skills.subtitle": "Technologies I work with daily",
        "skills.viewAll": "View All Skills",
        "achievements.title": "Achievements & Impact",
        "achievements.subtitle": "Numbers that speak for themselves",
        "achievements.projects": "Enterprise Projects",
        "achievements.technologies": "Technologies & Tools",
        "achievements.infrastructure": "Infrastructure Deployments",
        "achievements.data": "GB Data Processed",
        "projects.title": "Recent Work",
        "projects.subtitle": "Selected projects showcasing my skills",
        "projects.viewAll": "Explore All Projects",
        "testimonials.title": "What People Say",
        "testimonials.subtitle": "Feedback from clients and colleagues",
        "testimonials.quote1": "Diogo demonstrated exceptional skills in setting up and managing our Hadoop infrastructure. His work on the REV@CONSTRUCTION project enabled us to process sensor data at scale, providing crucial insights for our road pavement research.",
        "testimonials.author1.name": "Prof. Miguel Azenha",
        "testimonials.author1.role": "Research Coordinator, ISISE - UMinho",
        "testimonials.quote2": "During his time at MC Digital, Diogo quickly became a key member of our platform team. His expertise in Terraform and Azure infrastructure automation significantly improved our deployment processes and system reliability.",
        "testimonials.author2.name": "Ana Rodrigues",
        "testimonials.author2.role": "Platform Team Lead, MC Digital - Sonae",
        "testimonials.quote3": "Diogo's research on PHC's AI module showed great analytical thinking and business acumen. He identified practical applications that could transform how our clients handle their data and automate their processes.",
        "testimonials.author3.name": "Carlos Matsinhe",
        "testimonials.author3.role": "Technical Director, Mozaboot",
        "contact.title": "Let's Work Together",
        "contact.subtitle": "Have a project in mind? Let's talk!",
        "contact.button": "Get In Touch",
        "contact.schedule": "Schedule Call",
        "footer.quickLinks": "Quick Links",
        "footer.connect": "Connect",
        "footer.rights": "All rights reserved",
        "footer.tagline": "Platform Engineer building robust infrastructure solutions",
        "backToTop.label": "Back to top",
        "about.page.title": "About Me",
        "about.page.subtitle": "From Mozambique to Portugal: A Platform Engineer's Journey",
        "about.myStory.title": "My Story",
        "about.myStory.p1": "Born and raised in Maputo, Mozambique, my journey into technology began at the Portuguese School of Mozambique, where I discovered my passion for problem-solving and innovation. This passion led me to Portugal in 2016, where I pursued an Integrated Master's degree in Engineering and Management of Information Systems at the University of Minho.",
        "about.myStory.p2": "During my academic years, I discovered a fascination with how systems work at scale and how infrastructure enables amazing things to happen. What started as curiosity about technology grew into a genuine love for building reliable systems that make people's lives easier.",
        "about.myStory.p3": "Today, I work as a Platform Engineer at MC Digital (Sonae), where I get to combine my technical skills with my passion for solving real-world problems. Whether it's automating repetitive tasks or ensuring systems run smoothly, I find joy in the challenge of making complex things simple and reliable.",
        "about.myStory.p4": "Beyond the code and infrastructure, I'm driven by the belief that technology should be accessible and inclusive. My multicultural background—growing up in Mozambique and building my career in Portugal—has taught me the value of diverse perspectives in creating better solutions for everyone.",
        "about.behindCode.title": "Behind the Code",
        "about.behindCode.subtitle": "Life beyond the terminal",
        "about.behindCode.foodbank.title": "Food Bank Volunteer",
        "about.behindCode.foodbank.desc": "Helping families in need through food distribution at the Food Bank Against Hunger in Porto. Click to learn more about this experience.",
        "about.behindCode.amma.title": "Environmental Volunteer",
        "about.behindCode.amma.desc": "Contributing to ecosystem preservation through invasive species removal and tree planting with AMMA Matosinhos. Click to learn more about this initiative.",
        "about.behindCode.cultural.title": "Cultural Bridge",
        "about.behindCode.cultural.desc": "Growing up in Mozambique and now living in Portugal has given me a unique perspective on life and technology. I speak Portuguese natively, am fluent in English, and understand basic Spanish. This multicultural background helps me connect with diverse teams and bring different viewpoints to problem-solving.",
        "about.behindCode.learning.title": "Continuous Learning",
        "about.behindCode.learning.desc": "Technology evolves rapidly, and I love staying ahead of the curve. Whether it's exploring new cloud services, experimenting with emerging programming languages, or diving into the latest DevOps practices, I'm always learning. Currently fascinated by Infrastructure as Code patterns and the potential of AI in automating platform operations.",
        "about.behindCode.interests.title": "Interests & Hobbies",
        "about.behindCode.interests.desc": "When I'm not coding, you'll find me exploring Porto's vibrant tech meetups, hiking in the beautiful Portuguese countryside, or experimenting with home automation projects. I enjoy building Raspberry Pi projects, contributing to open-source initiatives, and occasionally playing strategy games that challenge my problem-solving skills in different ways.",
        "about.behindCode.values.title": "Values & Philosophy",
        "about.behindCode.values.desc": "I believe in writing clean, maintainable code that others can understand and build upon. Automation should eliminate repetitive tasks, not complicate simple ones. Every technical decision should be driven by business value. And most importantly, technology should be inclusive and accessible to everyone, regardless of their background.",
        "about.behindCode.goals.title": "Future Goals",
        "about.behindCode.goals.desc": "Looking ahead, I aim to deepen my expertise in cloud-native architectures and contribute to large-scale distributed systems. I'm passionate about mentoring junior engineers and sharing knowledge through technical writing and speaking at conferences. My goal is to become a technical leader who bridges the gap between cutting-edge technology and practical business solutions.",
        "about.modal.foodbank.title": "Food Bank Against Hunger",
        "about.modal.foodbank.subtitle": "Social Action Volunteer | September 2024 | Porto, Portugal",
        "about.modal.foodbank.p1": "Volunteering at the Food Bank Against Hunger in Porto has been an incredibly rewarding experience. As part of the social action team, I contribute to ensuring food security for vulnerable populations in the Porto region.",
        "about.modal.foodbank.activitiesTitle": "Activities & Responsibilities:",
        "about.modal.foodbank.activity1": "Receiving and sorting food donations from local businesses and individuals",
        "about.modal.foodbank.activity2": "Organizing food items by category and expiration date for efficient distribution",
        "about.modal.foodbank.activity3": "Distributing food packages to families in need with dignity and respect",
        "about.modal.foodbank.activity4": "Collaborating with team members to streamline the logistics of food distribution",
        "about.modal.foodbank.activity5": "Supporting community initiatives that raise awareness about food waste and hunger",
        "about.modal.foodbank.p2": "This experience has taught me the importance of community solidarity and how small actions can make a significant difference in people's lives. It's a reminder that beyond technology and code, we all have a responsibility to contribute to our communities.",
        "about.modal.amma.title": "AMMA - Matosinhos Environment",
        "about.modal.amma.subtitle": "Environmental Volunteer | November 2024 | Matosinhos, Portugal",
        "about.modal.amma.p1": "Through Matosinhos City Council's environmental program AMMA (Association for the Environment of Matosinhos), I've been actively involved in protecting and preserving local ecosystems.",
        "about.modal.amma.activitiesTitle": "Conservation Activities:",
        "about.modal.amma.activity1": "Participated in invasive species removal projects to protect native biodiversity",
        "about.modal.amma.activity2": "Helped plant native tree species to restore natural habitats",
        "about.modal.amma.activity3": "Learned about local flora and fauna and the importance of ecosystem balance",
        "about.modal.amma.activity4": "Contributed to environmental education initiatives in the community",
        "about.modal.amma.activity5": "Worked alongside environmental experts and passionate volunteers",
        "about.modal.amma.p2": "This hands-on environmental work has deepened my appreciation for nature and sustainability. It's shown me that protecting our environment requires active participation from everyone, and that even small contributions can help preserve our planet for future generations.",
        "skills.page.title": "Skills & Technologies",
        "skills.page.subtitle": "My technical expertise",
        "projects.page.title": "Projects",
        "projects.page.subtitle": "My portfolio of work",
        "projects.search.placeholder": "Search projects...",
        "projects.filter.all": "All",
        "projects.filter.dataScience": "Data Science",
        "projects.filter.webDev": "Web Development",
        "projects.filter.backend": "Backend & APIs",
        "projects.filter.devops": "DevOps & Cloud",
        "projects.filter.automation": "Automation",
        "projects.filter.mobile": "Mobile Apps",
        "contact.page.title": "Get In Touch",
        "contact.page.subtitle": "Let's discuss your project",
        "contact.form.name": "Name",
        "contact.form.email": "Email",
        "contact.form.subject": "Subject",
        "contact.form.message": "Message",
        "contact.form.budget": "Budget (Optional)",
        "contact.form.budgetPlaceholder": "Select budget range",
        "contact.form.budget1": "Less than $5,000",
        "contact.form.budget2": "$5,000 - $10,000",
        "contact.form.budget3": "$10,000 - $25,000",
        "contact.form.budget4": "More than $25,000",
        "contact.form.submit": "Send Message",
        "contact.info.title": "Let's Connect",
        "contact.info.subtitle": "Feel free to reach out for collaborations or just a friendly hello",
        "contact.info.email.title": "Email",
        "contact.info.location.title": "Location",
        "contact.info.location.value": "Lisbon, Portugal",
        "contact.info.response.title": "Response Time",
        "contact.info.response.value": "Within 24-48 hours",
        "contact.info.follow.title": "Follow Me",
        "resume.page.title": "Resume",
        "resume.page.subtitle": "My professional experience",
        "resume.download": "Download PDF",
        "resume.summary.title": "Professional Summary",
        "resume.summary.text": "Platform Engineer with expertise in cloud infrastructure, automation, and Big Data platforms. Currently managing Azure environments with Infrastructure as Code at MC Digital (Sonae), one of Portugal's largest retail operations. Strong foundation in Linux systems administration, data engineering, and distributed systems. Experienced in building scalable solutions using Terraform, Ansible, Databricks, and Cloudera. Passionate about automation, reliability, and creating infrastructure that enables teams to deliver value efficiently.",
        "resume.experience.title": "Experience",
        "resume.exp1.title": "Platform Engineer",
        "resume.exp1.company": "MC Digital (Sonae)",
        "resume.exp1.date": "September 2024 - Present",
        "resume.exp1.desc": "Managing cloud infrastructure and Big Data platforms for one of Portugal's largest retail operations through the Programa Contacto initiative.",
        "resume.exp1.achievement1": "Designing and implementing Infrastructure as Code using Terraform for Azure environments",
        "resume.exp1.achievement2": "Managing Linux systems and automating repetitive tasks with Ansible and Bash scripting",
        "resume.exp1.achievement3": "Configuring Big Data platforms including Hadoop, Databricks, and Cloudera",
        "resume.exp1.achievement4": "Providing technical support and solving complex infrastructure challenges",
        "resume.exp1.achievement5": "Ensuring security and compliance across all platform deployments",
        "resume.exp2.title": "Internship",
        "resume.exp2.company": "Mozaboot",
        "resume.exp2.date": "February 2024 - March 2024",
        "resume.exp2.desc": "Explored PHC ERP system architecture and researched AI module applications for business automation.",
        "resume.exp2.achievement1": "Analyzed ERP system architecture to identify integration opportunities",
        "resume.exp2.achievement2": "Researched AI module applications for business process automation",
        "resume.exp2.achievement3": "Collaborated with technical team to identify value propositions for enterprise clients",
        "resume.exp3.title": "Research Grant",
        "resume.exp3.company": "ISISE, University of Minho",
        "resume.exp3.date": "February 2022 - June 2023",
        "resume.exp3.desc": "Built and managed a Hadoop cluster for the REV@CONSTRUCTION project, processing sensor data from road pavements.",
        "resume.exp3.achievement1": "Built and managed a Hadoop cluster for processing large-scale sensor data",
        "resume.exp3.achievement2": "Developed Python scripts for data ingestion and processing pipelines",
        "resume.exp3.achievement3": "Implemented Delta Lake architecture for reliable data storage",
        "resume.exp3.achievement4": "Automated file transfers between Windows and Linux systems",
        "resume.education.title": "Education",
        "resume.edu1.title": "Integrated Master's Degree",
        "resume.edu1.institution": "University of Minho",
        "resume.edu1.date": "September 2016 - June 2023",
        "resume.edu1.desc": "Engineering and Management of Information Systems. Focused on distributed systems, data engineering, and software development. Developed strong foundations in both technical and management aspects of IT.",
        "resume.edu2.title": "High School",
        "resume.edu2.institution": "Portuguese School of Mozambique",
        "resume.edu2.date": "September 2013 - July 2016",
        "resume.edu2.desc": "Science and Technology track in Maputo, Mozambique. First exposure to programming and computer science, which sparked my passion for technology and problem-solving.",
        "resume.languages.title": "Languages",
        "hero.tagline1": "Platform Engineer",
        "hero.tagline2": "Infrastructure Automation",
        "hero.tagline3": "Big Data Expert",
        "hero.tagline4": "Cloud Specialist",
        "levels.expert": "Expert",
        "levels.advanced": "Advanced",
        "levels.intermediate": "Intermediate",
        "levels.beginner": "Beginner",
        "levels.novice": "Novice",
        "experience.years": "years",
        "status.real": "REAL",
        "status.completed": "COMPLETED",
        "status.inProgress": "IN PROGRESS",
        "status.planned": "PLANNED",
        "difficulty.novice": "Novice",
        "difficulty.beginner": "Beginner",
        "difficulty.intermediate": "Intermediate",
        "difficulty.advanced": "Advanced",
        "difficulty.expert": "Expert",
        "category.dataScience": "Data Science",
        "category.webDev": "Web Dev",
        "category.backend": "Backend",
        "category.devops": "DevOps",
        "category.automation": "Automation",
        "category.mobile": "Mobile",
        "buttons.demo": "Demo",
        "buttons.code": "Code",
        "buttons.soon": "Soon",
        "validation.required": "This field is required",
        "validation.email": "Please enter a valid email address",
        "validation.sending": "Sending...",
        "feedback.success": "Message sent successfully!",
        "feedback.error": "Failed to send message. Please try again.",
        "messages.noSkills": "No skills data available.",
        "project.1.title": "MotoGP Analytics Dashboard",
        "project.1.description": "Interactive dashboard analyzing MotoGP race data, lap times, and rider performance using Python and Jupyter notebooks.",
        "project.2.title": "Premier League Analytics",
        "project.2.description": "Comprehensive analysis of Premier League statistics including player performance, team metrics, and match predictions.",
        "project.3.title": "Streamlit Sales Dashboard",
        "project.3.description": "Interactive sales dashboard built with Streamlit, featuring real-time data visualization and KPI tracking.",
        "project.4.title": "Spotify Mood Analyzer",
        "project.4.description": "Machine learning model that analyzes your Spotify playlists to predict and visualize your music mood patterns.",
        "project.5.title": "Crypto Price Predictor",
        "project.5.description": "Time series forecasting model for cryptocurrency prices using Facebook Prophet and historical market data.",
        "project.6.title": "Netflix Content Recommender",
        "project.6.description": "Collaborative filtering recommendation system for Netflix content based on user viewing patterns.",
        "project.7.title": "Weather Pattern Visualizer",
        "project.7.description": "Interactive dashboard for visualizing weather patterns, climate trends, and predictive forecasting.",
        "project.8.title": "Portfolio Website v3",
        "project.8.description": "Modern, responsive portfolio website built with vanilla JavaScript, featuring dark mode and multi-language support.",
        "project.9.title": "Task Flow",
        "project.9.description": "Minimalist task management app with drag-and-drop functionality, local storage, and productivity analytics.",
        "project.10.title": "DevLinks Hub",
        "project.10.description": "Developer-focused link aggregator similar to Linktree with GitHub integration and customizable themes.",
        "project.11.title": "Code Snippet Manager",
        "project.11.description": "Web app to organize and share code snippets with syntax highlighting, tags, and search functionality.",
        "project.12.title": "Markdown Notes",
        "project.12.description": "Real-time markdown editor with live preview, file management, and export to multiple formats.",
        "project.13.title": "SQL Murder Mystery",
        "project.13.description": "Interactive SQL learning game where you solve a murder mystery by querying a database.",
        "project.14.title": "Weather API Gateway",
        "project.14.description": "RESTful API that aggregates weather data from multiple sources with caching and rate limiting.",
        "project.15.title": "URL Shortener Service",
        "project.15.description": "URL shortening service with custom aliases, QR codes, and detailed analytics dashboard.",
        "project.16.title": "JWT Auth Microservice",
        "project.16.description": "Reusable authentication microservice with JWT tokens, refresh tokens, and role-based access control.",
        "project.17.title": "Data Pipeline API",
        "project.17.description": "REST API for processing CSV files and returning statistical insights and visualizations.",
        "project.18.title": "Docker Dumb AI",
        "project.18.description": "Containerized AI application deployed to Docker Hub, demonstrating CI/CD pipeline setup.",
        "project.19.title": "Azure Infrastructure Automation",
        "project.19.description": "Terraform scripts for automated Azure resource provisioning including Databricks, Key Vaults, and networking.",
        "project.20.title": "Kubernetes Cluster Monitor",
        "project.20.description": "Real-time monitoring dashboard for Kubernetes clusters with Prometheus metrics and Grafana visualization.",
        "project.21.title": "CI/CD Pipeline Template",
        "project.21.description": "Reusable GitHub Actions workflows for Python and Node.js projects with testing and deployment.",
        "project.22.title": "Terraform AWS Starter",
        "project.22.description": "Infrastructure as Code templates for common AWS architectures including VPC, EC2, and RDS setups.",
        "project.23.title": "Email Report Automator",
        "project.23.description": "Python script that generates and sends automated reports via email with data visualizations.",
        "project.24.title": "Social Media Scheduler",
        "project.24.description": "Automated posting tool for multiple social media platforms with content calendar and analytics.",
        "project.25.title": "File Organizer Bot",
        "project.25.description": "Automated file organization system that sorts downloads by type, date, and custom rules.",
        "project.26.title": "Web Scraper Dashboard",
        "project.26.description": "Automated web scraping tool with price monitoring, alerts, and historical data tracking.",
        "project.27.title": "Linux System Automation",
        "project.27.description": "Ansible playbooks and Bash scripts for Linux system administration and user management.",
        "project.28.title": "Expense Tracker Lite",
        "project.28.description": "React Native app for personal expense tracking with categories, budgets, and spending insights.",
        "project.29.title": "Workout Timer",
        "project.29.description": "HIIT workout timer app with customizable intervals, rest periods, and workout history tracking.",
        "project.30.title": "Daily Journal",
        "project.30.description": "Minimalist journaling app with mood tracking, photo attachments, and cloud sync.",
        "skills.category.1.name": "Languages & Core",
        "skills.category.1.description": "Programming languages and core technologies",
        "skills.category.2.name": "Data Science & Visualization",
        "skills.category.2.description": "Data analysis, visualization and machine learning",
        "skills.category.3.name": "Big Data Platforms",
        "skills.category.3.description": "Large-scale data processing and analytics platforms",
        "skills.category.4.name": "Cloud & Infrastructure",
        "skills.category.4.description": "Cloud platforms and infrastructure automation",
        "skills.category.5.name": "DevOps & Automation",
        "skills.category.5.description": "CI/CD, automation, and operational excellence",
        "skills.category.6.name": "Databases & Storage",
        "skills.category.6.description": "Relational, NoSQL, and data storage solutions"
    },
    "pt": {
        "nav.home": "Início",
        "nav.about": "Sobre",
        "nav.skills": "Competências",
        "nav.projects": "Projetos",
        "nav.resume": "Currículo",
        "nav.contact": "Contacto",
        "hero.greeting": "Olá",
        "hero.tagline": "Platform Engineer | Automação de Infraestrutura | Big Data | Cloud",
        "hero.cta.projects": "Ver Projetos",
        "hero.cta.cv": "Descarregar CV",
        "about.title": "Sobre Mim",
        "about.preview.text": "Platform Engineer com experiência em automação de infraestrutura, ecossistemas Big Data e tecnologias cloud. Atualmente na MC Digital (Sonae), especializado em gestão de plataformas, infraestrutura de dados e práticas DevOps. Apaixonado por transformar desafios técnicos complexos em soluções eficientes e escaláveis que impulsionam a inovação.",
        "about.preview.highlight1": "Infraestrutura como Código com Terraform & Azure",
        "about.preview.highlight2": "Administração de Sistemas Linux & Automação",
        "about.preview.highlight3": "Plataformas Big Data (Hadoop, Databricks, Cloudera)",
        "about.preview.highlight4": "Ansible & Bash Scripting para Automação",
        "about.preview.highlight5": "Desenvolvimento Python para Engenharia de Dados",
        "about.readMore": "Ler História Completa →",
        "skills.title": "Competências Principais",
        "skills.subtitle": "Tecnologias com que trabalho diariamente",
        "skills.viewAll": "Ver Todas as Competências",
        "achievements.title": "Conquistas & Impacto",
        "achievements.subtitle": "Números que falam por si",
        "achievements.projects": "Projetos Empresariais",
        "achievements.technologies": "Tecnologias & Ferramentas",
        "achievements.infrastructure": "Implementações de Infraestrutura",
        "achievements.data": "GB de Dados Processados",
        "projects.title": "Trabalho Recente",
        "projects.subtitle": "Projetos selecionados que demonstram as minhas competências",
        "projects.viewAll": "Explorar Todos os Projetos",
        "testimonials.title": "O Que Dizem",
        "testimonials.subtitle": "Feedback de clientes e colegas",
        "testimonials.quote1": "O Diogo demonstrou competências excecionais na configuração e gestão da nossa infraestrutura Hadoop. O seu trabalho no projeto REV@CONSTRUCTION permitiu-nos processar dados de sensores em escala, fornecendo insights cruciais para a nossa investigação sobre pavimentos rodoviários.",
        "testimonials.author1.name": "Prof. Miguel Azenha",
        "testimonials.author1.role": "Coordenador de Investigação, ISISE - UMinho",
        "testimonials.quote2": "Durante o seu tempo na MC Digital, o Diogo tornou-se rapidamente um membro-chave da nossa equipa de plataforma. A sua experiência em Terraform e automação de infraestrutura Azure melhorou significativamente os nossos processos de implementação e fiabilidade do sistema.",
        "testimonials.author2.name": "Ana Rodrigues",
        "testimonials.author2.role": "Líder da Equipa de Plataforma, MC Digital - Sonae",
        "testimonials.quote3": "A investigação do Diogo sobre o módulo de IA da PHC mostrou grande pensamento analítico e perspicácia empresarial. Identificou aplicações práticas que poderiam transformar a forma como os nossos clientes gerem os seus dados e automatizam os seus processos.",
        "testimonials.author3.name": "Carlos Matsinhe",
        "testimonials.author3.role": "Diretor Técnico, Mozaboot",
        "contact.title": "Vamos Trabalhar Juntos",
        "contact.subtitle": "Tem um projeto em mente? Vamos conversar!",
        "contact.button": "Entrar em Contacto",
        "contact.schedule": "Agendar Chamada",
        "footer.quickLinks": "Links Rápidos",
        "footer.connect": "Conectar",
        "footer.rights": "Todos os direitos reservados",
        "footer.tagline": "Platform Engineer a construir soluções robustas de infraestrutura",
        "backToTop.label": "Voltar ao topo",
        "about.page.title": "Sobre Mim",
        "about.page.subtitle": "De Moçambique para Portugal: A Jornada de um Platform Engineer",
        "about.myStory.title": "A Minha História",
        "about.myStory.p1": "Nascido e criado em Maputo, Moçambique, a minha jornada na tecnologia começou na Escola Portuguesa de Moçambique, onde descobri a minha paixão por resolução de problemas e inovação. Esta paixão levou-me a Portugal em 2016, onde segui um Mestrado Integrado em Engenharia e Gestão de Sistemas de Informação na Universidade do Minho.",
        "about.myStory.p2": "Durante os meus anos académicos, descobri um fascínio por como os sistemas funcionam em escala e como a infraestrutura permite que coisas incríveis aconteçam. O que começou como curiosidade sobre tecnologia cresceu num amor genuíno por construir sistemas fiáveis que facilitam a vida das pessoas.",
        "about.myStory.p3": "Hoje, trabalho como Platform Engineer na MC Digital (Sonae), onde consigo combinar as minhas competências técnicas com a minha paixão por resolver problemas do mundo real. Seja a automatizar tarefas repetitivas ou a garantir que os sistemas funcionam suavemente, encontro alegria no desafio de tornar coisas complexas simples e fiáveis.",
        "about.myStory.p4": "Para além do código e infraestrutura, sou movido pela crença de que a tecnologia deve ser acessível e inclusiva. O meu background multicultural—crescer em Moçambique e construir a minha carreira em Portugal—ensinou-me o valor de perspetivas diversas na criação de melhores soluções para todos.",
        "about.behindCode.title": "Para Além do Código",
        "about.behindCode.subtitle": "A vida para além do terminal",
        "about.behindCode.foodbank.title": "Voluntário do Banco Alimentar",
        "about.behindCode.foodbank.desc": "A ajudar famílias necessitadas através da distribuição de alimentos no Banco Alimentar Contra a Fome no Porto. Clique para saber mais sobre esta experiência.",
        "about.behindCode.amma.title": "Voluntário Ambiental",
        "about.behindCode.amma.desc": "A contribuir para a preservação de ecossistemas através da remoção de espécies invasoras e plantação de árvores com a AMMA Matosinhos. Clique para saber mais sobre esta iniciativa.",
        "about.behindCode.cultural.title": "Ponte Cultural",
        "about.behindCode.cultural.desc": "Crescer em Moçambique e agora viver em Portugal deu-me uma perspetiva única sobre a vida e a tecnologia. Falo português nativamente, sou fluente em inglês e compreendo espanhol básico. Este background multicultural ajuda-me a conectar com equipas diversas e trazer pontos de vista diferentes para a resolução de problemas.",
        "about.behindCode.learning.title": "Aprendizagem Contínua",
        "about.behindCode.learning.desc": "A tecnologia evolui rapidamente, e adoro estar à frente da curva. Seja a explorar novos serviços cloud, a experimentar linguagens de programação emergentes, ou a mergulhar nas últimas práticas DevOps, estou sempre a aprender. Atualmente fascinado por padrões de Infraestrutura como Código e o potencial da IA na automação de operações de plataforma.",
        "about.behindCode.interests.title": "Interesses & Hobbies",
        "about.behindCode.interests.desc": "Quando não estou a programar, encontram-me a explorar os vibrantes meetups de tecnologia do Porto, a fazer caminhadas na bela paisagem portuguesa, ou a experimentar projetos de automação doméstica. Gosto de construir projetos com Raspberry Pi, contribuir para iniciativas open-source, e ocasionalmente jogar jogos de estratégia que desafiam as minhas capacidades de resolução de problemas de diferentes formas.",
        "about.behindCode.values.title": "Valores & Filosofia",
        "about.behindCode.values.desc": "Acredito em escrever código limpo e manutenível que outros possam entender e desenvolver. A automação deve eliminar tarefas repetitivas, não complicar as simples. Cada decisão técnica deve ser orientada por valor empresarial. E mais importante, a tecnologia deve ser inclusiva e acessível a todos, independentemente do seu background.",
        "about.behindCode.goals.title": "Objetivos Futuros",
        "about.behindCode.goals.desc": "Olhando para o futuro, pretendo aprofundar a minha experiência em arquiteturas cloud-native e contribuir para sistemas distribuídos em larga escala. Sou apaixonado por mentorar engenheiros juniores e partilhar conhecimento através de escrita técnica e palestras em conferências. O meu objetivo é tornar-me um líder técnico que faça a ponte entre tecnologia de ponta e soluções práticas de negócio.",
        "about.modal.foodbank.title": "Banco Alimentar Contra a Fome",
        "about.modal.foodbank.subtitle": "Voluntário de Ação Social | Setembro 2024 | Porto, Portugal",
        "about.modal.foodbank.p1": "Fazer voluntariado no Banco Alimentar Contra a Fome no Porto tem sido uma experiência incrivelmente gratificante. Como parte da equipa de ação social, contribuo para garantir a segurança alimentar de populações vulneráveis na região do Porto.",
        "about.modal.foodbank.activitiesTitle": "Atividades & Responsabilidades:",
        "about.modal.foodbank.activity1": "Receção e separação de doações de alimentos de empresas e particulares locais",
        "about.modal.foodbank.activity2": "Organização de alimentos por categoria e data de validade para distribuição eficiente",
        "about.modal.foodbank.activity3": "Distribuição de pacotes de alimentos a famílias necessitadas com dignidade e respeito",
        "about.modal.foodbank.activity4": "Colaboração com membros da equipa para agilizar a logística de distribuição de alimentos",
        "about.modal.foodbank.activity5": "Apoio a iniciativas comunitárias que aumentam a consciencialização sobre desperdício alimentar e fome",
        "about.modal.foodbank.p2": "Esta experiência ensinou-me a importância da solidariedade comunitária e como pequenas ações podem fazer uma diferença significativa na vida das pessoas. É um lembrete de que para além da tecnologia e código, todos temos a responsabilidade de contribuir para as nossas comunidades.",
        "about.modal.amma.title": "AMMA - Ambiente Matosinhos",
        "about.modal.amma.subtitle": "Voluntário Ambiental | Novembro 2024 | Matosinhos, Portugal",
        "about.modal.amma.p1": "Através do programa ambiental AMMA da Câmara Municipal de Matosinhos (Associação para o Ambiente de Matosinhos), tenho estado ativamente envolvido na proteção e preservação de ecossistemas locais.",
        "about.modal.amma.activitiesTitle": "Atividades de Conservação:",
        "about.modal.amma.activity1": "Participação em projetos de remoção de espécies invasoras para proteger a biodiversidade nativa",
        "about.modal.amma.activity2": "Ajuda na plantação de espécies de árvores nativas para restaurar habitats naturais",
        "about.modal.amma.activity3": "Aprendizagem sobre flora e fauna locais e a importância do equilíbrio do ecossistema",
        "about.modal.amma.activity4": "Contribuição para iniciativas de educação ambiental na comunidade",
        "about.modal.amma.activity5": "Trabalho ao lado de especialistas ambientais e voluntários apaixonados",
        "about.modal.amma.p2": "Este trabalho ambiental prático aprofundou a minha apreciação pela natureza e sustentabilidade. Mostrou-me que proteger o nosso ambiente requer participação ativa de todos, e que mesmo pequenas contribuições podem ajudar a preservar o nosso planeta para as gerações futuras.",
        "skills.page.title": "Competências & Tecnologias",
        "skills.page.subtitle": "A minha experiência técnica",
        "projects.page.title": "Projetos",
        "projects.page.subtitle": "O meu portfólio de trabalho",
        "projects.search.placeholder": "Pesquisar projetos...",
        "projects.filter.all": "Todos",
        "projects.filter.dataScience": "Data Science",
        "projects.filter.webDev": "Desenvolvimento Web",
        "projects.filter.backend": "Backend & APIs",
        "projects.filter.devops": "DevOps & Cloud",
        "projects.filter.automation": "Automação",
        "projects.filter.mobile": "Aplicações Mobile",
        "contact.page.title": "Entre em Contacto",
        "contact.page.subtitle": "Vamos discutir o seu projeto",
        "contact.form.name": "Nome",
        "contact.form.email": "Email",
        "contact.form.subject": "Assunto",
        "contact.form.message": "Mensagem",
        "contact.form.budget": "Orçamento (Opcional)",
        "contact.form.budgetPlaceholder": "Selecione o intervalo de orçamento",
        "contact.form.budget1": "Menos de $5.000",
        "contact.form.budget2": "$5.000 - $10.000",
        "contact.form.budget3": "$10.000 - $25.000",
        "contact.form.budget4": "Mais de $25.000",
        "contact.form.submit": "Enviar Mensagem",
        "contact.info.title": "Vamos Conectar",
        "contact.info.subtitle": "Sinta-se à vontade para entrar em contacto para colaborações ou apenas um olá amigável",
        "contact.info.email.title": "Email",
        "contact.info.location.title": "Localização",
        "contact.info.location.value": "Lisboa, Portugal",
        "contact.info.response.title": "Tempo de Resposta",
        "contact.info.response.value": "Dentro de 24-48 horas",
        "contact.info.follow.title": "Siga-me",
        "resume.page.title": "Currículo",
        "resume.page.subtitle": "A minha experiência profissional",
        "resume.download": "Descarregar PDF",
        "resume.summary.title": "Resumo Profissional",
        "resume.summary.text": "Platform Engineer com experiência em infraestrutura cloud, automação e plataformas Big Data. Atualmente a gerir ambientes Azure com Infraestrutura como Código na MC Digital (Sonae), uma das maiores operações retalhistas de Portugal. Forte base em administração de sistemas Linux, engenharia de dados e sistemas distribuídos. Experiência em construir soluções escaláveis usando Terraform, Ansible, Databricks e Cloudera. Apaixonado por automação, fiabilidade e criar infraestrutura que permite às equipas entregar valor de forma eficiente.",
        "resume.experience.title": "Experiência",
        "resume.exp1.title": "Platform Engineer",
        "resume.exp1.company": "MC Digital (Sonae)",
        "resume.exp1.date": "Setembro 2024 - Presente",
        "resume.exp1.desc": "Gestão de infraestrutura cloud e plataformas Big Data para uma das maiores operações retalhistas de Portugal através da iniciativa Programa Contacto.",
        "resume.exp1.achievement1": "Desenho e implementação de Infraestrutura como Código usando Terraform para ambientes Azure",
        "resume.exp1.achievement2": "Gestão de sistemas Linux e automação de tarefas repetitivas com Ansible e Bash scripting",
        "resume.exp1.achievement3": "Configuração de plataformas Big Data incluindo Hadoop, Databricks e Cloudera",
        "resume.exp1.achievement4": "Fornecimento de suporte técnico e resolução de desafios complexos de infraestrutura",
        "resume.exp1.achievement5": "Garantia de segurança e conformidade em todas as implementações de plataforma",
        "resume.exp2.title": "Estágio",
        "resume.exp2.company": "Mozaboot",
        "resume.exp2.date": "Fevereiro 2024 - Março 2024",
        "resume.exp2.desc": "Exploração da arquitetura do sistema ERP PHC e investigação de aplicações do módulo de IA para automação empresarial.",
        "resume.exp2.achievement1": "Análise da arquitetura do sistema ERP para identificar oportunidades de integração",
        "resume.exp2.achievement2": "Investigação de aplicações do módulo de IA para automação de processos empresariais",
        "resume.exp2.achievement3": "Colaboração com a equipa técnica para identificar propostas de valor para clientes empresariais",
        "resume.exp3.title": "Bolsa de Investigação",
        "resume.exp3.company": "ISISE, Universidade do Minho",
        "resume.exp3.date": "Fevereiro 2022 - Junho 2023",
        "resume.exp3.desc": "Construção e gestão de um cluster Hadoop para o projeto REV@CONSTRUCTION, processando dados de sensores de pavimentos rodoviários.",
        "resume.exp3.achievement1": "Construção e gestão de um cluster Hadoop para processar dados de sensores em larga escala",
        "resume.exp3.achievement2": "Desenvolvimento de scripts Python para pipelines de ingestão e processamento de dados",
        "resume.exp3.achievement3": "Implementação da arquitetura Delta Lake para armazenamento fiável de dados",
        "resume.exp3.achievement4": "Automação de transferências de ficheiros entre sistemas Windows e Linux",
        "resume.education.title": "Educação",
        "resume.edu1.title": "Mestrado Integrado",
        "resume.edu1.institution": "Universidade do Minho",
        "resume.edu1.date": "Setembro 2016 - Junho 2023",
        "resume.edu1.desc": "Engenharia e Gestão de Sistemas de Informação. Foco em sistemas distribuídos, engenharia de dados e desenvolvimento de software. Desenvolvimento de fortes fundações tanto em aspetos técnicos como de gestão de TI.",
        "resume.edu2.title": "Ensino Secundário",
        "resume.edu2.institution": "Escola Portuguesa de Moçambique",
        "resume.edu2.date": "Setembro 2013 - Julho 2016",
        "resume.edu2.desc": "Curso de Ciências e Tecnologias em Maputo, Moçambique. Primeira exposição à programação e ciência da computação, que despertou a minha paixão por tecnologia e resolução de problemas.",
        "resume.languages.title": "Idiomas",
        "hero.tagline1": "Platform Engineer",
        "hero.tagline2": "Automação de Infraestrutura",
        "hero.tagline3": "Especialista Big Data",
        "hero.tagline4": "Especialista Cloud",
        "levels.expert": "Especialista",
        "levels.advanced": "Avançado",
        "levels.intermediate": "Intermédio",
        "levels.beginner": "Iniciante",
        "levels.novice": "Principiante",
        "experience.years": "anos",
        "status.real": "REAL",
        "status.completed": "CONCLUÍDO",
        "status.inProgress": "EM PROGRESSO",
        "status.planned": "PLANEADO",
        "difficulty.novice": "Principiante",
        "difficulty.beginner": "Iniciante",
        "difficulty.intermediate": "Intermédio",
        "difficulty.advanced": "Avançado",
        "difficulty.expert": "Especialista",
        "category.dataScience": "Data Science",
        "category.webDev": "Desenvolvimento Web",
        "category.backend": "Backend",
        "category.devops": "DevOps",
        "category.automation": "Automação",
        "category.mobile": "Mobile",
        "buttons.demo": "Demo",
        "buttons.code": "Código",
        "buttons.soon": "Em Breve",
        "validation.required": "Este campo é obrigatório",
        "validation.email": "Por favor insira um endereço de email válido",
        "validation.sending": "A enviar...",
        "feedback.success": "Mensagem enviada com sucesso!",
        "feedback.error": "Falha ao enviar mensagem. Por favor tente novamente.",
        "messages.noSkills": "Nenhum dado de competências disponível.",
        "project.1.title": "Dashboard de Análise MotoGP",
        "project.1.description": "Dashboard interativo analisando dados de corridas MotoGP, tempos de volta e desempenho dos pilotos usando Python e Jupyter notebooks.",
        "project.2.title": "Análise Premier League",
        "project.2.description": "Análise abrangente de estatísticas da Premier League incluindo desempenho de jogadores, métricas de equipa e previsões de jogos.",
        "project.3.title": "Dashboard de Vendas Streamlit",
        "project.3.description": "Dashboard de vendas interativo construído com Streamlit, com visualização de dados em tempo real e acompanhamento de KPIs.",
        "project.4.title": "Analisador de Humor Spotify",
        "project.4.description": "Modelo de machine learning que analisa as suas playlists do Spotify para prever e visualizar padrões de humor musical.",
        "project.5.title": "Preditor de Preços Cripto",
        "project.5.description": "Modelo de previsão de séries temporais para preços de criptomoedas usando Facebook Prophet e dados históricos de mercado.",
        "project.6.title": "Recomendador de Conteúdo Netflix",
        "project.6.description": "Sistema de recomendação por filtragem colaborativa para conteúdo Netflix baseado em padrões de visualização de utilizadores.",
        "project.7.title": "Visualizador de Padrões Meteorológicos",
        "project.7.description": "Dashboard interativo para visualizar padrões meteorológicos, tendências climáticas e previsões preditivas.",
        "project.8.title": "Website Portfolio v3",
        "project.8.description": "Website portfolio moderno e responsivo construído com JavaScript vanilla, com modo escuro e suporte multi-idioma.",
        "project.9.title": "Task Flow",
        "project.9.description": "Aplicação minimalista de gestão de tarefas com funcionalidade drag-and-drop, armazenamento local e análise de produtividade.",
        "project.10.title": "DevLinks Hub",
        "project.10.description": "Agregador de links focado em desenvolvedores similar ao Linktree com integração GitHub e temas personalizáveis.",
        "project.11.title": "Gestor de Code Snippets",
        "project.11.description": "Aplicação web para organizar e partilhar snippets de código com syntax highlighting, tags e funcionalidade de pesquisa.",
        "project.12.title": "Notas Markdown",
        "project.12.description": "Editor markdown em tempo real com pré-visualização ao vivo, gestão de ficheiros e exportação para múltiplos formatos.",
        "project.13.title": "Mistério de Assassinato SQL",
        "project.13.description": "Jogo interativo de aprendizagem SQL onde resolve um mistério de assassinato consultando uma base de dados.",
        "project.14.title": "Gateway API Meteorológica",
        "project.14.description": "API RESTful que agrega dados meteorológicos de múltiplas fontes com caching e limitação de taxa.",
        "project.15.title": "Serviço Encurtador de URLs",
        "project.15.description": "Serviço de encurtamento de URLs com aliases personalizados, códigos QR e dashboard de análise detalhada.",
        "project.16.title": "Microserviço de Autenticação JWT",
        "project.16.description": "Microserviço de autenticação reutilizável com tokens JWT, tokens de refresh e controlo de acesso baseado em funções.",
        "project.17.title": "API Pipeline de Dados",
        "project.17.description": "API REST para processar ficheiros CSV e retornar insights estatísticos e visualizações.",
        "project.18.title": "Docker Dumb AI",
        "project.18.description": "Aplicação AI containerizada implementada no Docker Hub, demonstrando configuração de pipeline CI/CD.",
        "project.19.title": "Automação de Infraestrutura Azure",
        "project.19.description": "Scripts Terraform para provisionamento automatizado de recursos Azure incluindo Databricks, Key Vaults e networking.",
        "project.20.title": "Monitor de Cluster Kubernetes",
        "project.20.description": "Dashboard de monitorização em tempo real para clusters Kubernetes com métricas Prometheus e visualização Grafana.",
        "project.21.title": "Template Pipeline CI/CD",
        "project.21.description": "Workflows GitHub Actions reutilizáveis para projetos Python e Node.js com testes e implementação.",
        "project.22.title": "Terraform AWS Starter",
        "project.22.description": "Templates de Infraestrutura como Código para arquiteturas AWS comuns incluindo configurações VPC, EC2 e RDS.",
        "project.23.title": "Automatizador de Relatórios Email",
        "project.23.description": "Script Python que gera e envia relatórios automatizados via email com visualizações de dados.",
        "project.24.title": "Agendador de Redes Sociais",
        "project.24.description": "Ferramenta de publicação automatizada para múltiplas plataformas de redes sociais com calendário de conteúdo e análises.",
        "project.25.title": "Bot Organizador de Ficheiros",
        "project.25.description": "Sistema automatizado de organização de ficheiros que ordena downloads por tipo, data e regras personalizadas.",
        "project.26.title": "Dashboard de Web Scraper",
        "project.26.description": "Ferramenta automatizada de web scraping com monitorização de preços, alertas e rastreamento de dados históricos.",
        "project.27.title": "Automação de Sistemas Linux",
        "project.27.description": "Playbooks Ansible e scripts Bash para administração de sistemas Linux e gestão de utilizadores.",
        "project.28.title": "Rastreador de Despesas Lite",
        "project.28.description": "App React Native para rastreamento de despesas pessoais com categorias, orçamentos e insights de gastos.",
        "project.29.title": "Temporizador de Treino",
        "project.29.description": "App temporizador de treino HIIT com intervalos personalizáveis, períodos de descanso e histórico de treinos.",
        "project.30.title": "Diário Pessoal",
        "project.30.description": "App minimalista de diário com rastreamento de humor, anexos de fotos e sincronização na cloud.",
        "skills.category.1.name": "Linguagens & Core",
        "skills.category.1.description": "Linguagens de programação e tecnologias core",
        "skills.category.2.name": "Data Science & Visualização",
        "skills.category.2.description": "Análise de dados, visualização e machine learning",
        "skills.category.3.name": "Plataformas Big Data",
        "skills.category.3.description": "Plataformas de processamento e análise de dados em larga escala",
        "skills.category.4.name": "Cloud & Infraestrutura",
        "skills.category.4.description": "Plataformas cloud e automação de infraestrutura",
        "skills.category.5.name": "DevOps & Automação",
        "skills.category.5.description": "CI/CD, automação e excelência operacional",
        "skills.category.6.name": "Bases de Dados & Armazenamento",
        "skills.category.6.description": "Soluções relacionais, NoSQL e armazenamento de dados"
    }
}
